In [34]:
data <- read.csv("G:/Jupyter/R/ML/dataset/Data.csv")
data

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

In [6]:
#take care of Missing Data
#age_mean <- mean(data$Age, na.rm=1)
#age_mean

[1] 38.77778

In [35]:
data$Age <- ifelse(is.na(data$Age) ,mean(data$Age, na.rm=1), data$Age)

In [36]:
data

   Country Age      Salary Purchased
1  France  44.00000 72000  No
2  Spain   27.00000 48000  Yes
3  Germany 30.00000 54000  No
4  Spain   38.00000 61000  No
5  Germany 40.00000    NA  Yes
6  France  35.00000 58000  Yes
7  Spain   38.77778 52000  No
8  France  48.00000 79000  Yes
9  Germany 50.00000 83000  No
10 France  37.00000 67000  Yes

In [37]:
data$Salary <- ifelse(is.na(data$Salary) ,mean(data$Salary, na.rm=1), data$Salary)
data
str(data)

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

'data.frame':	10 obs. of  4 variables:
 $ Country  : chr  "France" "Spain" "Germany" "Spain" ...
 $ Age      : num  44 27 30 38 40 ...
 $ Salary   : num  72000 48000 54000 61000 63778 ...
 $ Purchased: chr  "No" "Yes" "No" "No" ...

### Encoding

In [38]:
data$Country <- factor(data$Country,
                       levels = c('France', 'Spain', 'Germany'),
                       labels = c(1:3))
data

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 No
2  2       27.00000 48000.00 Yes
3  3       30.00000 54000.00 No
4  2       38.00000 61000.00 No
5  3       40.00000 63777.78 Yes
6  1       35.00000 58000.00 Yes
7  2       38.77778 52000.00 No
8  1       48.00000 79000.00 Yes
9  3       50.00000 83000.00 No
10 1       37.00000 67000.00 Yes

In [39]:
data$Purchased <- factor(data$Purchased,
                       levels = c("Yes", "No"),
                       labels = c(1,0))
data

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 0
10 1       37.00000 67000.00 1

## Splitting

In [ ]:
set.seed(1234)